#Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.

arr = [1,2,3,4,5,6,7,8,9,1,2,3,4,5,6]
arr = list(set(arr))
print (arr)
