import random
#Реализовать алгоритм перемешивания списка.
def interfere(string):
    for i in range(len(string)-1):

    return list

print(interfere([1,2,3,4,5,6,7,8,9]))
